{"podcast_details": {"podcast_title": "Simple Flying Aviation News Podcast", "episode_title": "#183: Simple Flying Meets Avensis Aviation's CEO, Cristain Sutter", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded_nologo/3171651/3171651-1581508404673-a969cd163dd4a.jpg", "episode_transcript": " Hello, my name is Tom Boone. Welcome to a brand new episode of the Simple Flying Podcast, where we usually give you the lowdown on the latest news from the world of commercial aviation. This week I'm joined by Chris Sutter, CEO of Aventus Aviation, to talk about the passenger to freight conversion market. Chris, welcome to the show. Thank you very much, Tom. Thank you for having me. No worries. Thank you for being here. So, you know, we were chatting and you've moved into the freighter market kind of as a result of the boom of freight during COVID. I wondered if you could quickly start by describing, you know, the pandemic's impact on freight and why you made the jump from sort of passenger focused cabins to freighters. Well, that was, you know, COVID were very interesting times during the pandemic, especially for aviation. There were many situations we never faced as an industry as a whole. And it forced many of us to think very quickly in our feet what the next steps were. And in terms of cargo, obviously, at the time, and still is nowadays, part of the global cargo is moved by what we call belly freight in the industry or spare capacity in the cargo hold of a commercial aircraft. And obviously, with the pandemic, when the commercial aviation came to a halt, there was a lot of capacity that was lost in terms of freighter. And at the same time, the basically confinement and the pandemic, it required or the lockdown of us, we call it in the UK, forced a lot of people to buy online. So and there's a lot of also, you know, personal protection equipment has to be shipped from, you know, as a globalized world from manufacturing countries in the Far East. So if you combine all that together, it meant that the cargo capacity was going through a huge demand, and there was there was no much of it available. So it became very apparent that something needed to be done in terms of support the effort of, you know, global shifting of goods and protection equipment for medical reasons, and boosting the freighter capacity. So I think at that time, I thought there was the right the right moment to shift from commercial aviation, which obviously, as everyone knew at the time, it came to a halt, but also new program developments and everything that was ongoing at the time, also came to a halt globally. And I realized very quickly, there was a need in the markets to be covered, but not only for the short term, because at some point, we were all hopeful that the COVID was coming going to come to an end. But also from the long term point of view, where the cargo conversion markets was basically targeting a single type of design in the market, there was a bit more separated with the drive of e commerce, obviously, a multiple mission aircraft, which is a very heavy conversion, might not necessarily be the most adequate type of aircraft to fly it. So I realized very quickly that there were there were needs in the markets that could be covered with specific conversion, passenger to freighter conversion designs, obviously started with COVID. But then in our case, it quickly evolved into a portfolio solutions to target this mid to long term market. So I think that at the time, I just had a career 22 years in commercial aviation, the future was quite asserting in commercial aviation. And I thought that, you know, I could put my my experience and skill sets to better use into the passenger freighter conversion sector, which was starting to gear up as a very exciting pipeline to the future. So that's eventually why I did the switch from one sector to another. And I'm still still pretty much enjoying working in the cargo sector. And I found it really interesting just then that you said the commercial aviation sector was looking uncertain, because that kind of leads into my next question. So I've been talking to quite a few airline CEOs recently, you know, I'll use Arizona's Peter Foster as an example, you know, that at the height of COVID, they were talking about converting some of their 767s to freighters. And then a couple of months ago, I chased him up on this and he said, Oh, you know, actually, we're seeing cargo demand drying up as COVID sort of disappears, so that we're not interested in that. So I wondered if you could briefly talk about, from your point of view, the future of the cargo market in that sort of regard. I think that that's very interesting, because I would like to separate the short term outlook of the cargo market or the demand of the cargo market into dedicated freighter capacity. And the mid to long term, I think that we, when we started advances aviation, almost three years ago, we knew very well that the craze of COVID driven demand in the freighter sector was not going to last. And at some point, the sector, the cargo sector was going to consolidate and, and some of the new starters and new operators or some of the companies that they diverted their business strategy from, let's say, pure passenger into opening a cargo, a cargo division might not necessarily go forward when the passenger demand was predicted to come back. I think what has happened is the combination of global situation that no one could envisage beyond COVID, which is obviously the conflict in Ukraine, the interest rates going out, going up, sorry, inflation, fuel crisis, all of those effects obviously are starting to calm down, luckily. And there's a direction forward in which, for instance, global prices are coming down again. But the combination of that with an unprecedented recovery, or quick, quicker recovery than predicted for the passenger sector has made door term or very short term investments and switching from passenger to freighter not really so sustainable as it could have been at the beginning of the pandemic. But that's the nature of the business. And for us, it was very clear that we had to raid the, or ride, sorry, the COVID wave, but then we have to have a long term plan as a company because you couldn't expect surviving on providing certain types of passenger to freighter conversions that will no longer be required once the passenger demand is back. So coming back to your point, the important for us is obviously that the market in the mid to long term, it is strong, the market in terms of requesting certain types of certain numbers of passenger to freighter conversions. Obviously, the actual trafficking in the cargo sector, the yields have come down to more consolidated value of something more similar to pre COVID dates, because obviously that the rates that were commanded during the COVID, the height of the pandemic was were not sustainable, obviously. But the market long term requires replacement of an aging fleet, the cargo airplanes, we all know that if you don't buy them brand new, you usually take an asset that already has between 10 to 15 years of operation, then you convert it back to a freighter, which means that your life expectancy of that airframe can be around 25 years, 30 years, depending on your maintenance. So that means that there's a cycle that needs renovation. And we come into that cycle, we have retirements of MD11s, which were fantastic cargo airplane, 747s, obviously, came out of the production line with the last one being a freighter. But also there's an increasing number of aging 747-400 freighters that needs to be replaced. And the feedstock for aircraft like 767 has quickly depleted. So there's no much you can do in terms of future conversions to 767s. So that means that you either need brand new freighters, or you need to swap into another platform, or at least in the medium body, medium segment wide bodies, like an RSA 330 or 340, that provide that platform going forward in terms of feedstock. So from our point of view, we were not surprised that the market in terms of conversions was going to cool off a bit. It was on our predictions as a business model. That's why we just tapped into a scalable portfolio of conversions that could be upgraded to the full door conversion, which is what the market will be requiring in the medium to long term. So I think just to close this question, there was a time that everyone was, with the asset values or the aircraft values being so low at a time during the height of the pandemic, everyone thought that creating a cargo airline was kind of a flavor of the month and everyone jumped at it. But we all know that airlines needs to ride the wave and market fluctuations. So we were not surprised at many of those short term prospects that they were requiring a conversion ASAP were not going to last coming out of the pandemic. So I think that hopefully for us, we anticipated that maneuver within our product and market strategy. But yeah, I think that I second the point. Now things have calmed down quite a lot versus the height of the pandemic, but we all kind of knew there was the direction of things were going anyway. And sort of dialing a bit more now into events, this your flagship product is called NavVis. I wondered if you could just sort of give our listeners a brief overview of what exactly this entails. Because we were a company that started creating a portfolio product solutions, I would like to take it one step back with this. Part of our brand positioning strategy was also created brands for our products. Because obviously before it was just a simple type of passage of the freighter conversions with the COVID, the portfolio diversified into several different types of conversions. So NavVis for us, it's one of the brands, one of our product brands in terms of conversions, like you said, we call it the flagship because it's the most complex conversion. And that basically entails to have a main deck cargo door just to load pallets and containers. And obviously the incorporation of a cargo loading system to move those pallets and containers inside the cargo cabin. And it incorporates a series of other design features which are based in our portfolio. So what I'm saying this portfolio is that we have an engineering family approach. So when we started with the entry level conversions that we used to call NavVis, that's not in the catalog anymore because that's obviously ES exemptions stop this freighter type of conversions. We developed a conversion to class C type without the main cargo door. We invented that concept that didn't exist before and it's called Medius and it shares the engineering modifications in terms of the environmental control system and fire detection system to be in the class C. He shares it with Medius LF which features a lift or it shares it with NavVis as well, which also adds the doors in the CLS. So it's a modular approach to design. Coming to NavVis, we call it our flagship because it is the product that we always wanted to develop for the medium to long term solution and the passengers to freight sector, which essentially is adding a main deck cargo door. And the reason why I'm saying this is when the pandemic started, there were many leasing companies that had an excess of fleet that was not flying, but that didn't want to commit to convert that aircraft permanently into freighter aircraft, adding the door in the CLS just like the NavVis or some of the aircraft that our competitors have been doing for some time because they didn't know what the future was going to have in store and they might need that flexibility to lease that aircraft as a passenger after the cargo market calmed down a bit. So that's where we started Medius, which was a full class E cargo compartment, but fully reversible and it didn't have the main cargo door. And then you can scale it up all the way down to NavVis in case that if you're an operator that you grow your cargo business and you need now to tap into pallets and containers, you will need a full cargo door. And that's what something that NavVis offers. Or if you don't need to operate that aircraft anymore as a cargo airplane and you need to convert it back to passenger config, that's basically you can take the other direction and you can do that with the Medius. So NavVis, we call it the flagship because it's actually the full conversion cargo airplane by adding the door to CLS class E system. And once you make that decision, obviously that aircraft will finalize their life, their firm life as operating in a freighter configuration. It's not reversible anymore. That's why we just call it the top of the range. And for us, obviously in the market before there only existed this type of one or another conversion as in you go for freighter and you stay as a freighter. I think we were one of the first companies, if not the first to do, actually the first to do the class E compartment without a main cargo door, they give you that option. And then we build up the portfolio of passengers to freighter conversions all the way up to NavVis, which is what we call the flagship. And reading on your website, it says that you've got the first of its kind fully electrically operated plug type main deck cargo door. So I was wondering, to me that doesn't actually mean so much. So I was wondering if you could explain what makes it the first of its kind and how it differs to a standard cargo door. No, no, no problem. I think that sometimes, the cargo market is very specific. In aviation, we like a bit of jargon and acronyms. So it's absolutely fine. When it comes to plug type, the door design differs from other existing P2F conversions on Airbus A330, for instance. Because the door has a locking mechanism that it's impossible to open it in flight when the cabin is pressurized. So normal cargo door, they open outwards as a canopy type door, just like ours. But they have to use a triple locking electro hydraulic mechanism system. Because obviously, the more you pressurize the cabin, the more that pressure inside the cabin tends to open the door outwards. And there were some unfortunate incidents a few years ago with 757s from a major cargo operator that had one of those cargo doors open in flight. Luckily, nothing happened in terms of the crew and they could emerge to land the aircraft and no life losses. But it is one of those ironies that the more you pressurize the cabin, the more the door tries to open. Because you're essentially doing a large aperture in the fuselage of the aircraft. It's not like a passenger door. So the plug type means that it has a design that locks the door into the frame. And if you don't open the door inwards first, to go over this locking mechanism to open it outboard afterwards, the door will not be able to be opened. And the more you pressurize it, the more the locking mechanism locks itself. So that an inadvertently mid-flight opening would never happen because there's a mechanically locked system that turns into a plug door. Kind of similar idea like Boeing aircraft had back in the day when you had a slightly larger door than the actual frame. So you have to articulate it in a very specific manner to open the door inwards the aircraft before you open it outwards, which is you have in 737s and 747s and things like that. On aircraft like that, sorry. So it's kind of a similar concept, but applied to a full main deck cargo door. And it's electrically operated because of the design of the door. We don't use electro-hydraulic systems like normal doors are operated. It is a lighter system because we remove the hydraulics, which it removes maintenance and weight and moving parts. And we're fine enough to say not the plug type, but the fully electric operated door has been announced by Airbus under A350 freighter as an innovation. So we were just quite happy to say that Airbus was following the same path. If not, the plug door, at least if fully electrically operated. And sort of talking on the 350 while we're there, how difficult is it going to be in the future to convert cargo aircraft with say the composite fuselage of aircraft as opposed to metal? Because in metal, I understand you've got to be quite careful not to over or stress the frame while you're cutting a hole. But essentially, to me, it seems a lot easier to cut a hole in metal than composite. Well, I think not to you, I think to everyone in the industry. Well, I think 350 is a fantastic aircraft. I'd like to start opening like that. To make that comment about the airframe, I worked on it on the passenger version on several different configurations for airlines. I worked in the past and it is a fantastic aircraft. Composite wise, it relies heavily on composite. As far as my knowledge goes, it's not necessarily around the main structure of the fuselage. So you could work on a 350 in a conversion in a more friendly way in terms of cutting the primary structure than you could do, for instance, in a Boeing 787, which is almost fully plastic with carbon fiber reinforcement, as Boeing technically calls it. It's a different production process, a different type of airframe. So when it comes to 350, obviously, you have challenges because it's a far more advanced, technologically wise aircraft than the previous generation, for instance, 330s, which is fully aluminum and obviously composite in some areas that not what we touch, essentially flying surfaces. But when it comes to the door modification, it is not as a complex platform as it could be a 787 because the area you supposedly need to modify in terms of primary structure still pretty much aluminum based or aluminum alloy based. But yes, I think the composite manufacturing of fuselage, if it's a higher percentage like 787, complicate things greatly because essentially if you modify it, let's say in layman's terms, if you cut the whole and it doesn't work, you just write off the whole fuselage in one go. Whereas in an aluminum or metallic alloy based aircraft, the type of constructions with stringers and reinforcements allows you to do a repair of that area, which is something that a composite aircraft is so much more complex to do. But yes, I think that's one of the reasons why you haven't seen a 787 freighter aircraft yet, at least with a full cargo door installed on it. Well, one day maybe with the advanced technology, who knows. In terms of AVENSYS, what should we be looking out for in the future from you guys? Well, we have launched what we call our long term strategy products, which is MEDEOS 11 NavVis. Both products are tapping into the cargo air freight market using pallets and containers. Our intermediate product called MEDEOS was a first class E without the cargo door, but that meant it is a manual loading product. So obviously when you need to grow your operation and tap into the logistic networks in the air freight using standardized containers and pallets, you need the ability to load them in the main deck. And we have two products. And again, we are the only company that had two different technical avenues to achieve that. One of them is to try and test it main deck cargo door. Obviously our design is different. We talk about the plug type already, but conceptually wise, it still means that you have a larger aperture and fuselage and a cargo door to load the pallets and containers. And that's permanent modification. Going back to the lift, the MEDEOS 11 basically features two lift one on the forward section, one of the aft section of the aircraft. And that lifts basically connects the cargo hold or the lower or the belly hold with the main deck. So that means you can load palletized and containerized cargo through the belly and then lift it up into the main deck without the need of the main cargo door. What it does obviously, it gives you the ability to tap into pallets and containers as I mentioned earlier, without permanently modifying the primary structure of the aircraft. So if you decide to return it back to passenger configuration, you have that option. MEDEOS family is all about the ability to be able to reverse that configurations where NavVis it isn't. So you have, let's say a top of range conversion with the door and the step below as two options. So we have launched both of them. Then again, like I said, they share the same engineering familiarity concept. So most of the systems designed and certified for MEDEOS are rollover for MEDEOS 11 NavVis. And obviously the main difference is the way that you achieve loading the cargo into the main cargo deck, let's say. At the moment, obviously in the market, we are the only company offering two different avenues, two different technical solutions to achieve that with obviously their own different features or performance characteristics going for them. And I guess sort of one final question maybe for me to wrap it up, talking about the two different avenues that you have, what is the sort of percentage demand for the permanent conversion compared to the temporary, we can go back to passenger if we want conversion? During COVID obviously the demand was higher on the reversible conversions because that was a flexibility to operate your asset in either configuration, depending where the market was going. Now we're seeing direction going into the more permanent conversions, because we're talking to medium to long term fleet growth support and fleet replacement of aging freighters. Having this option that it's still reversible on the pallets and containers, that's something new that wasn't in the market before COVID. And we've seen a lot of interest in certain type of aircraft platform. Let's not forget the fact that you're taking an aircraft that then needs to be modified into a freighter and that changes the asset value. And obviously you have to get a return for investment of that conversion. There are certain aircraft type, adding a door makes them extremely expensive as a freighter. So having a lift in between, it's a less expensive conversion and gives you that possibility of tapping into the full air freight pallets and container market without committing to such a large financial decision, which could potentially be the door. So the market obviously has reacted in a very positive way for us, for media to let, but uncertain specific aircraft type. Whereas the other, the Navi store has a more broad appeal into the wide body segment, if that makes sense. It does. It does. So thank you so much for your time today, Chris. Absolutely. It's a pleasure. Thank you very much for having me. No worries. That's all for today's podcast. We hope you enjoyed it and we welcome any feedback at editorial at simpleflying.com. For more great content, you can visit our website at simpleflying.com or find us on social media. Simply search for simple flying. If you enjoyed this podcast, please leave us a rating on your favorite podcast player."}, "podcast_summary": "In this podcast episode, Tom Boone interviews Chris Sutter, CEO of Aventus Aviation, about the passenger to freight conversion market. They discuss the impact of COVID-19 on the freight industry and the shift from passenger-focused cabins to freighters. Chris explains that during the pandemic, there was a significant increase in freight demand due to the loss of capacity in passenger aircraft and the rise in online shopping. He also highlights the need for more specific conversion designs to meet the evolving demands of the global cargo market. The conversation then moves on to the future of the cargo market and the challenges of converting cargo aircraft with composite fuselages. Chris introduces Aventus Aviation's flagship product, NavVis, which is a fully electrically operated plug-type main deck cargo door. He explains that this type of door is the first of its kind and offers enhanced safety features compared to traditional cargo doors. The discussion concludes with a focus on Aventus Aviation's long-term strategy products, MEDEOS and NavVis, and the demand for reversible and permanent conversions in the cargo market. Chris explains that while there was a higher demand for reversible conversions during the pandemic, the market is now shifting towards permanent conversions, particularly in the wide body segment. Overall, Aventus Aviation aims to provide innovative and flexible solutions to meet the evolving needs of the cargo industry.", "podcast_guest": {"name": "Chris Sutter", "org": "Aventus Aviation", "title": "", "summary": "Not Available"}, "podcast_highlights": "Key Moments and Highlights:\n\n1. Insightful Comment: Chris Sutter mentions that the COVID-19 pandemic caused a significant loss of cargo capacity in the aviation industry due to the halt in commercial aviation. This led to a surge in demand for freighter conversion to meet the needs of shipping goods and medical supplies.\n\n2. Critical Question: Tom Boone asks about the future of the cargo market and the challenges faced by airlines that initially converted passenger aircraft to freighters due to COVID-19. Sutter explains that the market has cooled off for short-term conversions, but there is a strong demand for medium to long-term conversions to replace aging cargo aircraft.\n\n3. Hot Topic: The discussion touches on the development of Navvis, a flagship product of Aventus Aviation. Sutter explains that Navvis is a passenger to freighter conversion that includes a main deck cargo door and a cargo loading system. This conversion caters to the mid to long-term market needs for pallets and containerized cargo.\n\n4. Noteworthy Opinion: Sutter expresses the company's focus on scalability and portfolio solutions. He mentions their innovative approach of offering reversible conversions, such as Medius, that can be converted back to a passenger configuration. This provides flexibility for operators as the cargo market fluctuates.\n\n5. Insightful Comment: Sutter explains the concept of a \"plug type\" main deck cargo door on Navvis. This design prevents mid-flight openings by using a locking mechanism that cannot be opened in flight when the cabin is pressurized. The fully electrically operated door makes the conversion process lighter and more efficient.\n\n6. Hot Topic: The conversation briefly touches on the challenges of converting cargo aircraft with composite fuselages, such as the Boeing 787. Sutter mentions that the primary structure of the Airbus A350, which Aventus works with, is still mostly aluminum-based and allows for modifications without the complexities of composites.\n\n7. Noteworthy Opinion: Sutter highlights Aventus' two different technical solutions for cargo conversions, Medius and Navvis. He explains that during the pandemic, there was a higher demand for reversible conversions due to market uncertainty. However, the focus is now shifting towards more permanent conversions to support long-term fleet growth and replacement of aging freighters.\n\nOverall, this episode of the podcast provides insights into the impact of the COVID-19 pandemic on the cargo market and the future of passenger to freighter conversions. The discussion highlights the innovative solutions offered by Aventus Aviation and the evolving demands of the cargo industry."}