{"podcast_details": {"podcast_title": "AI Chat: ChatGPT &amp; AI News, Artificial Intelligence, OpenAI, Machine Learning", "episode_title": "Transformer Paper Author Leaves Google to Start \"Sakana\" a Nature-Inspired AI", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/staging/podcast_uploaded_nologo/36533826/36533826-1690590009569-87bdf4899028d.jpg", "episode_transcript": " Welcome to the AI Chat Podcast. I'm your host, Jayden Schafer. Every day I break down AI news, interview guests, and explain the implications of AI in your life and business. Make sure that you go to AIBOX.AI, link in the show notes, to join the waitlist for our new AI platform. We're going to be launching an incredible platform that allows you to build anything you want with workflows in AI. So you're able to chain together chat GPT and image generators and audio generators to make really powerful apps for your organization, or you can host them on our marketplace and actually generate royalties from them. So make sure to go to AIBOX.AI and join the waitlist. In addition, if you like the podcast, if you can do me a massive favor and please leave us a review on Apple or Spotify or wherever you listen to your podcast. This helps me be able to get better guests on here as they check the reviews to see how you guys are liking it. So if you could please do that, I would really, really appreciate it. Have you ever wanted to start your own podcast? I record and publish this podcast on a platform called Spotify for Podcasters and I absolutely love it. Essentially what you can do is upload from your phone or computer and it distributes it to every platform that plays podcasts. They support video podcasts and you can make money on the platform with ads or even podcast subscriptions. It's something that has made my life so much easier as a podcaster. So if you're interested, I highly recommend you give it a try. You can download the Spotify for Podcasters app or go to Spotify.com slash podcasters to get started. Today on the podcast, we are talking about a new startups called Sakana AI out of Japan that wants to build nature inspired artificial intelligence. This was founded by former Google AI luminaries, Leon Jones and David Ha and Saka AI essentially promises to deliver a revolutionary approach to foundational AI models. So today on the podcast, we're going to be diving into what they're building and why we think that this is relatively important in the industry today. So Jones isn't new to revolutionary ideas. He actually co-authored the 2017 ground baking Google research paper, Attention Is All You Need. It's kind of funny because I swear every single person that co-authored that paper has gone on to found some of the biggest AI companies. I'm not sure if, I mean, obviously they were like very ahead of their time and came up with a very interesting concept, but I think beyond that, just the brand name and the name recognition of that paper and how important it is made it really easy for all of them to go and get venture funding for their companies, right? If they were that early on that and were able to come up with that bit of revolutionary technology, they're obviously deeply ingrained in the space and poised to do some really great things with research and tech. So it's kind of funny to see, or it's exciting to see all of these guys come out and have really awesome AI companies. So Jones was working at Google for 12 years. He just left and he is now the CTO of Sakana AI. And on the other side, we have Hawk, who is, you know, essentially is the CEO and he previously spearheaded Google's AI research initiatives in Japan. He also helmed research at AI upstart, stability AI. Both Jones and Haw are on a mission to conceive AI models rooted in the insight drawn from natural systems. Now this is awesome. Both of these guys have a ton of experience at big AI companies making big AI plays. And so I'm here for it to see what they're going to be building. But essentially, Sakana itself translates to fish in Japan. And that is essentially what their philosophy is. So the duo envisions AI models that much like a school of fish are individual units, synced synchronizing seamlessly to operate as one unified entity. Drawing from the intelligence exhibited by nature and fundamentals such as evolution and emergence, they are committed to essentially devising AI solutions that are adaptable rather than static and inflexible. Now one thing I do want to say about this, you know, like having the whole school, the school of fish concept or whatever, this isn't entirely new and it's not like, oh my gosh, these are the first people to do this. I'm sure they're going to do a lot of really innovative things and I'll, I'll hover some more things that they're doing here. That's interesting. But what I did want to bring up is that chat GBT is actually doing this in a way, probably on not such a granular scale that they're about to go into. But I do think this concept is really interesting. And so I think that they're actually in the right direction because essentially what was there was a bunch of leaks recently for model weights of chat GBT and we were able to get a lot of insights into what they're doing. But essentially in that leak, we found out that chat GBT is essentially segmented into 16 different professionals. And so it's like there's 16 mini models in chat GBT. There's one model when you ask a question, it determines which of the 16 models could respond best. That's why sometimes I feel like when I ask questions in different ways, like the answer like it was like really variably different. And I think it's because it may have switched over to a new one of those like professionals or experts. But anyways, that's, that's a theory. I'm not 100% sure about. In any case, that's exactly how chat GBT is working. They essentially determine which of the 16 they have an expert that responds to you and they have it segmented out. This I think could be the solution. If you go a little bit further, I'm hoping with chat GBT, they go a little bit further to be five, they go a little bit further because this could be the solution to like chat GBT not being good at math where essentially, essentially it can integrate multiple of these experts into one thing, right? So it's like, it's going to have the logic and reasoning expert. That's really good at math mixed with one that's good at like, I don't know, English or something, because sometimes it's tricky in a sense that it feels like you're getting one of the experts and not the other right now. But in any case, I think that could fix a lot of the problems, but it looks like that's exactly what Sakana is kind of aiming to do here. So I think this could be an antidote to the challenges like exorbitant costs and looming security threats posed by current AI models. Models that consume mass amounts of data and computing resources like chat GBT are obviously incredibly expensive and this also might be a way to cut down on those costs. So rather than merely expanding transformer models, Jones and Ha are aiming to kind of architect innovative, leaner techniques, right? They're not going to make these, these models that cost millions and millions of dollars, although they may still cost millions of dollars, but you know, I think open AI spent like over $540 million last year, something crazy. And so obviously they probably aren't going to have that kind of arsenal of cash. So they're going to be doing this lean, which I think is good. It's going to use a lot less resources, making a lot of smaller models. So this will be interesting to see how this kind of leaner technique plays out. So without going into the nitty gritty, essentially they are building, they're looking at the possibility of smaller interconnected models working in tandem, sort of like a flock of birds or school of fish to tackle challenges. This mythology, methodology really promises to be more sustainable and secure than models centralized around one massive data set. I also think this is a wise move. If we're seeing a lot of lawsuits come out right now, right? New York times is suing or looking at suing open AI for using its data. A lot of other people would follow suit if they won. And so imagine if you will, where you have like, you know, a thousand mini AI models that are all using different data sets, doing different things. And if for some reason you have a massive lawsuit in one of these thousand AI models, you could just remove that model. Or though, preferably you could figure out a way to just retrain it. But after removing that thing from the data set, you don't have to retrain the entire thing. It's really hard to extract one data set from, from like ChaiGBT for example, because you've already trained the whole thing and that was included. But now it's like, well, we have a thousand, so we just have to like retrain a thousandth of our model, excluding that data set. So I think in that regard too, this also could be a really good play to kind of segment out the AI models into a lot of smaller kind of micro models, if you will. So I think this might be a good play in that regard. And I think that the decision essentially was to establish this company in Tokyo, which is really cool. Not a lot of AI companies that are making headline news right now are out of Tokyo, a lot of New York and San Francisco. So I like to see a little diversification in location here. While several former Google AI employees have congregated to global AI epicenters like Silicon Valley, Jones and Hall have charted a different path. They say that Tokyo with its robust technical backbone, pool of educated professionals and thriving research holds some unique appeal. So this is one other thing that I will say that I like about this move beyond just like, oh, it's a new place other than Silicon Valley. I really think that if we want to have a very global and robust and diverse AI ecosystem, we need to do this. We need to spread out. We can't just have everyone from everywhere around the world all congregate in Silicon Valley inside of what is sort of a tech think bubble where a lot of people all think the same. There is so many different places around the world with so many different ways of thinking. And I do think it's very healthy to have a lot of different perspective. Now I know most of my listeners are from California, but I'm sure you guys, you all see it too, right? There is a lot of people think the same way inside of their own bubbles and circles. And so I think spreading it out gives you a lot of diversity, which is really, really powerful and a great thing to see. So I think that the city has a lot of international expertise combined with its potential to hold to mold AI solutions for non-Western context. I think that holds a lot of promise. A lot of different Asian cultures have different ways of thinking or solving problems that has been traditionally really helpful in a global system of trade. And now I think it's going to be good to add this is an AI layer here as well. So I think it's no secret that the AI domain is really saturated right now. There's a lot of companies coming into this space and playing in this. We have Google, Microsoft that are really kind of fighting company and startups like Anthropic and Coheer and OpenAI and all that kind of stuff. But Jones and Haad discern a, or essentially they see what they call a concerning trend, which is the overpowering commercial drive that could be dampening genuine innovation. So their ethos is to reignite the spear of unbridled exploration. I know that's kind of generic, so cool, whatever. I'm not going to put much credence in that until I actually see what they produce. But in any case, I think their unique trajectory of second AI really resonates with researchers who are looking for a shift from really, I don't know, commercial rigidity to something a little bit more exciting and interesting. So regardless of if that haggling there actually means anything, I think it does a good job in getting some of the top talent to want to work at your company. So in that regard, you know, tip of the hat, this is you got to do what you got to do. And I think that's a great move. So the company has already onboarded an academic scholar and is looking for more visionaries, passionate about foundational research. I think their journey is really about building something innovative. You know, I think given its leadership's strong foundation and their innovative approach, I think it might be able to be a really big disruptor in the AI realm and introduce some foundational principles that, you know, are going to shape the way a lot of things are happening in AI. If this approach that they are working on proves to be true, I think we would see big companies like OpenAI and others follow suit and take more of this nature-based approach where essentially you're segmenting all your AIs into many, many micro AIs and it's much, much more efficient and perhaps better protected against lawsuits and it actually gives better responses. So this is what we're going to be left to see as they continue developing. Thank you for listening to the AI Chat Podcast. If you enjoyed the podcast, I'd appreciate it if you rate me wherever you listen to podcasts. And if you're looking for an innovative group of AI enthusiasts, make sure you check out our Discord channel and also our Facebook community. It's obviously a lot more interactive than a podcast where we can actually share software tools prompts that we're using in everyday AI. I'll leave a link for those in the description below."}, "podcast_summary": "The podcast discusses a new startup called Sakana AI from Japan, founded by former Google AI employees Leon Jones and David Ha. The startup aims to develop nature-inspired artificial intelligence models that operate as a unified entity, much like a school of fish. They aim to create adaptable AI solutions that are more sustainable and secure than current models, addressing challenges such as high costs and potential security threats. The founders believe that Tokyo provides a unique environment for their research and development, with a strong technical backbone and a diverse talent pool. While the AI domain is saturated, Sakana AI offers an alternative approach focused on genuine innovation and unbridled exploration. The company is already onboarded an academic scholar and is actively seeking visionary researchers to join their team. Overall, Sakana AI aims to disrupt the AI realm and introduce foundational principles that could shape the future direction of the industry.", "podcast_guest": {"name": "Leon Jones", "org": "Sakana AI", "title": "", "summary": "Not Available"}, "podcast_highlights": "In this episode of the AI Chat Podcast, host Jayden Schafer discusses a new startup called Sakana AI. The founders, Leon Jones and David Ha, both former Google AI employees, aim to build nature-inspired artificial intelligence models. They envision AI models that function like a school of fish, operating as one unified entity and drawing from the intelligence exhibited by nature. This approach is seen as a potential solution to issues such as exorbitant costs and security threats posed by current AI models. By segmenting AI models into smaller interconnected units, Sakana AI aims to create more sustainable and secure models while also promoting innovation. The founders have chosen Tokyo as the location for their startup due to its robust technical backbone, pool of educated professionals, and potential for molding AI solutions for non-western contexts. While the AI domain is currently saturated, Jones and Ha hope to reignite the spirit of unbridled exploration and attract top talent passionate about foundational research. If Sakana AI's approach proves successful, it could have a significant impact on the AI industry and potentially influence larger companies to adopt a similar nature-based approach."}