{"podcast_details": {"podcast_title": "CoinDesk Podcast Network", "episode_title": "MARKETS DAILY: Featured Story | How Is Tokenization Impacting Investing?", "episode_image": "https://content.production.cdn.art19.com/images/83/8f/5c/d2/838f5cd2-c22d-445f-a333-ecf0110ecc1a/eed001a384c158556151dc13555f466fd1623653f03a64e656ae260c25b0f78eeb0adc7d1683a1cd23f57df4029413ba3ce7af0af85b36f6c2617081eee414cf.jpeg", "episode_transcript": " This episode of Market's Daily is sponsored by Kraken. It's Sunday, August 20th, 2023, and this is Market's Daily from CoinDesk. Hi, I'm Michelle Musso, here again with your weekend story. On today's show, we're taking a look at tokenization and how it could change the financial landscape. As always, just a reminder, CoinDesk is a news source and does not provide investment advice. Today's piece comes from Kelly Ye, head of research at Decentral Park Capital. The piece is titled, How is Tokenization Impacting Investing? We are using a Wondercraft AI voice for today's featured story. Hope you enjoy. Since their inception in 1993, ETFs have surpassed traditional mutual funds as the preferred investment vehicle for many investors to access capital markets. The remarkable growth of the ETF lineup has democratized the investment business by providing access to investment strategies and entire asset classes that were historically only available to the largest and most sophisticated investors. However, there is still a substantial portion of the investment universe that ETFs cannot reach. Alternative investments, such as private equity, private debt, and real assets, are typically available only in the form of private funds with constraints on liquidity, investor qualification, and minimum investment thresholds. According to a 2022 Fidelity study, institutions on average allocate around 23% to alternatives, while advisors only allocate approximately 6%. In an environment where a traditional 60-40 portfolio provides limited growth and income opportunities, alternative investments serve as valuable building blocks to enhance an investor's portfolio. It would be beneficial to have an ETF-like structure that offers transparency, liquidity, and efficiency to access these alternative investments. This is where blockchain technology can play a significant role through a process called tokenization. Tokenization involves representing real-world assets, such as private equity, real estate, fine art, commodities, and more, as digital tokens on a blockchain. By doing so, these assets become easily tradable and divisible, opening up new possibilities for fractional ownership and liquidity. Advisors can now present clients with a broader array of investment options, encompassing both traditional and digital assets, catering to different risk appetites and financial goals. Meet the all-new Kraken Pro, the powerful, customizable, beautiful way to trade crypto. It's Kraken's most powerful trading platform ever, packed with trading features like advanced order management and analytics tools, all in a redesigned, modular trading interface. So head to pro.kraken.com and trade like a pro. Not investment advice. Some crypto products and markets are unregulated. The unpredictable nature of the crypto assets market can lead to loss of funds and profits, may be subject to capital gains tax. Blockchain technology addresses three critical challenges for alternative investing, transparency, liquidity, and efficiency. First, transparency. Blockchain provides a tamper-resistant and immutable record of ownership and transactions on the tokenized asset. The assets and their ownership details are publicly visible on the ledger, enabling stakeholders to verify and track asset movements in real time. This transparency can help reduce fraud and increase trust among market participants. Second, liquidity. Tokenization allows fractional ownership, enhancing liquidity by enabling investors to buy and sell smaller portions of assets, rather than requiring substantial capital to buy an entire asset. These tokenized assets can also be traded on secondary markets 24-7, potentially increasing their overall liquidity. And lastly, efficiency. Tokenization allows for the automation of various processes, including ownership verification, settlement, and compliance. Smart contracts can facilitate the transfer of ownership and automate certain aspects of asset management. This automation can lead to increased efficiency and reduced operational costs. Once brought on chain, tokenized assets can participate in the DeFi flywheel and create more opportunities. For example, tokenized assets can serve as collateral for borrowing, thus improving the capital efficiency of owning these assets. Large institutions have started testing tokenization. For instance, KKR and Hamilton Lane both launched tokenized private funds in 2022 with Securitize, a fintech firm specialized in tokenization. Franklin Templeton has launched a tokenized money market fund in 2023, which gathered more than $270 million as of April 2023. Citigroup has forecasted a $4-5 trillion tokenized digital securities market by 2030 in their March 2023 Money, Tokens, and Games report. Despite all the potential benefits of tokenization, we are still at an early stage of development. Current tokenized products are all issued and traded within a walled garden, meaning on a specific tokenization platform, which hinders wider adoption. Regulatory clarity on the legal status and classification of these tokenized assets is crucial in determining where and how they can be issued and traded. Market infrastructure also needs to be developed to facilitate trading across different platforms. More importantly, investors' asset allocation model needs to evolve to embrace the possibility of allocating to real-world assets. But just like how ETFs democratized investing, tokenization is both a technological and financial innovation that could democratize alternative investments and open up many more opportunities for end investors to optimize their portfolios. And that's our show for today. Thank you for listening. I'm Michelle Musa with Markets Daily. And for those of you who are still with us, we'd love to hear what you think. You can email us at podcasts at coindesk.com with the subject line, Markets Daily. This episode was produced and edited by Eleanor Paul with the executive production by Jared Schwartz. Just a reminder, Coindesk is a news source and does not provide investment advice."}, "podcast_summary": "In this podcast episode sponsored by Kraken, the focus is on tokenization and its potential impact on investing. Tokenization involves representing real-world assets, such as private equity, real estate, commodities, and more, as digital tokens on a blockchain. This process provides transparency, liquidity, and efficiency to access alternative investments that were historically only available to large and sophisticated investors. The use of blockchain technology addresses challenges in alternative investing, including transparency, by providing a tamper-resistant and immutable record of ownership and transactions. It also enhances liquidity by allowing fractional ownership and 24/7 trading on secondary markets. Additionally, tokenization enables automation of ownership verification, settlement, and compliance, resulting in increased efficiency and reduced operational costs. While there are potential benefits to tokenization, the industry is still in its early stages, with tokenized products primarily traded on specific platforms. Regulatory clarity and market infrastructure development are needed to facilitate wider adoption. The evolution of investors' asset allocation models is also crucial to embrace the potential of allocating to real-world assets. Tokenization is seen as a technological and financial innovation that could democratize alternative investments and provide more opportunities for end investors to optimize their portfolios.", "podcast_guest": {"name": "Kelly Ye", "org": "Decentral Park Capital", "title": "", "summary": "Not Available"}, "podcast_highlights": "Key Moments and Highlights from the conversation in this episode of Market's Daily on tokenization:\n\nInsightful Comments:\n- ETFs have surpassed traditional mutual funds and provided access to investment strategies and asset classes previously only available to sophisticated investors.\n- Alternative investments such as private equity, private debt, and real assets have limited accessibility due to liquidity constraints and investor qualifications.\n\nCritical Questions:\n- How can blockchain technology and tokenization address the challenges of transparency, liquidity, and efficiency in alternative investments?\n- What are the potential benefits of tokenization and how can it democratize alternative investments?\n\nHot Topics:\n- The concept of tokenization and how it can represent real-world assets as digital tokens on a blockchain, enabling tradability and fractional ownership.\n- The potential for tokenized assets to serve as collateral for borrowing and participate in the decentralized finance (DeFi) ecosystem.\n- The early stages of development and the need for regulatory clarity, market infrastructure, and evolution in asset allocation models to fully embrace tokenization.\n\nNoteworthy Opinions:\n- Tokenization is considered a technological and financial innovation that could open up more opportunities for end investors to optimize their portfolios and democratize alternative investments.\n\nOverall, this episode explores the concept and potential of tokenization to revolutionize the financial landscape and provide broader investment options, enhanced liquidity, and increased efficiency in the alternative investments sector."}